{
    "intents": [
      {
        "intent": "greeting",
        "examples": [
          "Hello",
          "Hi",
          "Good morning",
          "Good evening",
          "Hey"
        ],
        "responses": [
          "Hello! How can I assist you today?",
          "Hi there! How can I help you?",
          "Good day! What can I do for you?"
        ]
      },
      {
        "intent": "services",
        "examples": [
          "What services does the Department of Justice provide?",
          "Tell me about your services",
          "What can I do on this website?"
        ],
        "responses": [
          "The Department of Justice provides various services including legal aid, information about judicial appointments, and updates on legal reforms. You can find more details on our 'Services' page.",
          "We offer information on judicial appointments, legal aid services, and updates on legal reforms. Visit our website for more details."
        ]
      },
      {
        "intent": "contact_information",
        "examples": [
          "How can I contact the Department of Justice?",
          "Where is your office located?",
          "Can I get contact details for your office?"
        ],
        "responses": [
          "You can contact us through the contact form on our 'Contact Us' page or reach us at [contact email/phone number]. Our office is located at [address].",
          "For contact details, visit our 'Contact Us' page. You can also reach us at [contact email/phone number] or visit our office at [address]."
        ]
      },
      {
        "intent": "legal_aid",
        "examples": [
          "How can I apply for legal aid?",
          "Tell me about legal aid services",
          "I need legal assistance. What should I do?"
        ],
        "responses": [
          "To apply for legal aid, please visit our 'Legal Aid' section and fill out the application form provided. You can also contact our legal aid office for assistance.",
          "Our legal aid services are designed to help those in need. Visit the 'Legal Aid' section of our website for more information and application details."
        ]
      },
      {
        "intent": "legal_reforms",
        "examples": [
          "What are the latest legal reforms?",
          "Tell me about recent changes in the law",
          "What new laws have been introduced?"
        ],
        "responses": [
          "For the latest information on legal reforms, check out the 'Legal Reforms' section of our website. We regularly update this section with information on new laws and amendments.",
          "Visit the 'Legal Reforms' page to stay updated on the latest changes in legislation and recent law introductions."
        ]
      },
      {
        "intent": "unknown",
        "examples": [
          "I don't understand",
          "Can you help me with something else?",
          "I have a different question"
        ],
        "responses": [
          "I'm sorry, I didn't quite understand that. Could you please rephrase your question?",
          "I'm here to help. Please let me know if you have another question or need assistance with something specific."
        ]
      }
    ]
  }
  